## Addtion of two numbers
suppose you have input like array and target ouput. Inside the array you get the target value when you sum of two numbers
Then return their indexes
1. arr = [0,1,3,4,5,6] and target_output = 7
output: [2,3]
2. arr = [0,1,2,3,4,] and target_output = 9
output:[]

In [10]:
class Solution:
    def __init__(self,arr,target):
        self.arr = arr
        self.t_output = target
    def addtwonumber(self):
        n = len(arr)
        for i in range(n):
            for j in range(i+1,n):
                if arr[i]+arr[j]==target:
                    return [i,j]
        return []

In [11]:


arr=[]
n = int(input("enter the number of element in array:"))
for i in range(n):
    num = int(input("enter the element:"))
    arr.append(num)
target = int(input("enter the target output:"))
x = Solution(arr,target)
x.addtwonumber()

enter the number of element in array:4
enter the element:2
enter the element:3
enter the element:4
enter the element:5
enter the target output:7

[0, 3]

### palindrome checking

In [13]:
def palindrome_check(num):
    if num<0:
        return False
    rev_num = 0
    temp = num
    while temp!=0:
        digit = temp%10
        rev_num = rev_num * 10 + digit
        temp//=10
    return (num == rev_num)

In [14]:
palindrome_check(121)

True

In [16]:
import pandas as pd
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [17]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [18]:
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [22]:
merge_df = pd.merge(person,address, on='personId',how='left')

In [23]:
merge_df

   personId firstName lastName  addressId           city     state
0         1      Wang    Allen       <NA>            NaN       NaN
1         2     Alice      Bob          1  New York City  New York

In [24]:
#selecting only specific column
merge_df = merge_df[['firstName','lastName','city','state']]

In [25]:
merge_df

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York